app/Models/BillModel.php

    public function edit($where, $data)
    {
        $this->builder->where($where);
        return $this->builder->update($data);
---
UPDATE `bill` SET `note` = 'TS truyền thống: Ít đường;TS trân châu đường đen: Đường nhiều'
WHERE `bill_id` = '1'